{
    "https://www.harlequin.com/shop/books/9780369705952_unbridled-cowboy.html": {
        "NAME": "Unbridled Cowboy",
        "PRICE": "Ebook $5.99 Paperback $7.99",
        "RATING": "4.25",
        "IMAGE": "https://i.harperapps.com/hqna/covers/9780369705952/y404.jpg",
        "AUTHOR": "by Maisey Yates",
        "DESCRIPTION": "“Intense and filled with heartbreak, warmth, overcoming the past, and finding a meant-to-be love. Yates has a special way of drawing readers into her complicated families.”—Jennifer Ryan, New York Times bestselling author  Welcome to Four Corners Ranch, where the West is still wild…and when a cowboy needs a wife, he decides to find her the old-fashioned way.   Cowboy Sawyer Garrett has no intention of settling down. But when he becomes a single dad to tiny baby June, stepping up to the responsibility is nonnegotiable. And so is finding a woman to be a mother to his infant daughter. So he decides to do it the way the pioneers did: by putting out an ad for a mail-order bride.   Evelyn Moore can’t believe she’s agreed to uproot her city life to marry a stranger in Oregon. But having escaped one near-disastrous marriage, she’s desperate for change. Her love for baby June is instant. Her feelings for Sawyer are…more complicated. Her gruff cowboy husband ignites thrilling desire in her, but Sawyer is determined to keep their marriage all about the baby. But what happens if Evelyn wants it all?   In bonus novella Once Upon a Cowboy, can single dad Adam give Belle the fairy tale she's always dreamed of?",
        "DATE": "Release Month: Jun 2022"
    },
    "https://www.harlequin.com/shop/books/9780369721921_a-perfect-plan.html": {
        "NAME": "A Perfect Plan",
        "PRICE": "Ebook $5.99 Paperback $6.39",
        "RATING": "",
        "IMAGE": "https://i.harperapps.com/hqna/covers/9780369721921/y404.jpg",
        "AUTHOR": "by Joanna Sims, Teri Wilson",
        "DESCRIPTION": "A deal with the maverick  The Maverick's Wedding Wager by Joanna Sims  Hardheaded cowboy Knox Crawford has his mind made up—he’s got to get married…and fast. Knox’s faux fiancée? Genevieve Lawrence, a gorgeous, sassy horsewoman who is not afraid of anything…except commitment. As they fake marry to trick Knox’s matchmaking dad, the two stubborn singles discover the only thing harder than pretending to be a couple is realizing they might be falling in love for real!  The Maverick's Secret Baby by Teri Wilson  Finn Crawford is going to be a dad. He can only imagine the fireworks when the Ellington family learns he slept with their cherished daughter Avery. Their families have been feuding for years. It’s no wonder sweet, expectant Avery balks at Finn’s suggestion of a convenient marriage. What’s more surprising is that the footloose, flirty rancher might secretly long for something more…  USA TODAY Bestselling Author Teri Wilson  2 Heartfelt Stories  The Maverick's Wedding Wager and The Maverick's Secret Baby",
        "DATE": "Release Month: Jun 2022"
    },
    "https://www.harlequin.com/shop/books/9780369707963_a-cinderella-for-the-princes-revenge.html": {
        "NAME": "A Cinderella for the Prince's Revenge",
        "PRICE": "Ebook $3.99 Larger Print $5.40 Paperback $4.40",
        "RATING": "",
        "IMAGE": "https://i.harperapps.com/hqna/covers/9780369707963/y404.jpg",
        "AUTHOR": "by Emmy Grayson",
        "DESCRIPTION": "This Cinderella romance from Emmy Grayson has it all—drama, revenge…and a royal proposal to remember!  His royal ring is on the table…  Her destiny is in his hands!  Small-town bartender Briony Smith’s exhilarating flirtation with customer Cass is a welcome distraction from her very ordinary existence. She’s speechless when Cass reveals he’s a prince and she’s a long-lost princess!  She’s even more shocked by his convenient proposal! Marrying Cass will allow her to be part of the family she’s never known. And their powerful attraction can only sweeten the deal. But will it still feel like a fairy tale after Cass’s admission that making her his bride is part of his plan for revenge?  From Harlequin Presents: Escape to exotic locations where passion knows no bounds.  Read all The Van Ambrose Royals books:  Book 1: A Cinderella for the Prince's Revenge",
        "DATE": "Release Month: Jun 2022"
    },
    "https://www.harlequin.com/shop/books/9780369720290_love-on-the-coast.html": {
        "NAME": "Love on the Coast",
        "PRICE": "Ebook $1.99",
        "RATING": "",
        "IMAGE": "https://i.harperapps.com/hqna/covers/9780369720290/y404.jpg",
        "AUTHOR": "by Jennifer Snow",
        "DESCRIPTION": "Can their whirlwind romance lead to a love that lasts?  Rachel Hempshaw doesn’t believe in fairy tales. As a writer for Dispelling the Myth magazine, having a healthy dose of skepticism is all part of the job. But when she’s sent on an Alaskan cruise to debunk the legend surrounding Sealena the Serpent Queen, Rachel’s investigation doesn’t go as planned. Especially not after a gorgeous coast guard officer gets involved.  Keeping Port Serenity safe has always been a point of pride for Callan Parks. But after his sister’s tragic death, the former marine has a new mission: raising his five-year-old niece, Darcy. Navigating the challenges of single parenthood isn’t easy. Still, if Callan can convince the beautiful and stubbornly skeptical Rachel to give the impossible a chance, they might all have a shot at happily-ever-after.",
        "DATE": "Release Month: Jun 2022"
    },
    "https://www.harlequin.com/shop/books/9781488214752_detection-detail-ready-to-protect-hiding-in-montana.html": {
        "NAME": "Detection Detail & Ready to Protect & Hiding in Montana",
        "PRICE": "Audiobook $29.99",
        "RATING": "",
        "IMAGE": "https://i.harperapps.com/covers/9781488214752/y404.jpg",
        "AUTHOR": "by Terri Reed, Valerie Hansen, Laura Scott",
        "DESCRIPTION": "Detection Detail An alleged arsonist. A deadly cover-up. Can this K-9 sniff out the truth?  Evidence at a fiery car crash leads K-9 officer Nelson Rivers and his accelerant-detection dog, Diesel, to Mia Turner—a woman previously accused of arson. But when a gunman targets Mia during their first meeting, Nelson suspects she might actually be innocent. Only Mia’s hiding something, and Nelson’s been burned before. Can they trust each other to catch a killer…before the threat engulfs them both?   Ready to Protect From USA TODAY bestselling author Valerie Hansen, a K-9 must safeguard a witness and her baby at all costs  After witnessing a congresswoman’s murder, wildlife photographer and mother-to-be Jamie London is forced into the protective custody of K-9 cop Ben Sawyer and police dog Shadow. Ben’s Wyoming cattle ranch is the perfect place to hide and wait for the trial to start—until they’re tracked down by the assassin. Are Ben and Shadow enough to guarantee Jamie will make it to the hearing alive?   Hiding in Montana From USA TODAY bestselling author Laura Scott, a fugitive at large…this K-9 is on his trail.  To save a woman from being kidnapped, Officer Chris Fuller and his K-9 partner, Teddy, have no choice but to let the fugitive they’re tracking get away. But when the escaped murderer returns to hunt tour pilot Lexie McDaniels again, Chris knows the attempted kidnapping wasn’t a chance encounter. Lexie won’t be safe until he catches the criminal…but are her secrets what is endangering them all?   From Love Inspired Suspense: Courage. Danger. Faith.  Rocky Mountain K-9 Unit",
        "DATE": "Release Month: Jun 2022"
    }
}